using OnlineStore.Data;
using OnlineStore.Domain.Models;

namespace OnlineStore.Web.Infrastructure
{
    public static class ApplicationBuilderExtensions
    {
        public static IApplicationBuilder PrepareDatabase (this IApplicationBuilder app)
        {
            var scopedServices = app.ApplicationServices.CreateScope();
            var serviceProvider = scopedServices.ServiceProvider;

            var data = serviceProvider.GetRequiredService<OnlineStoreDbContext>();
            
            SeedItems(data);

            return app;
        }

        private static void SeedItems(OnlineStoreDbContext data)
        {
            if (data.Items.Any())
            {
                return;
            }

            var items = new List<Item>();

            items.Add(new Item
            {
                Name = "АКУМУЛАТОРЕН ЧУПЕЩ СЕ ФЕНЕР 3W RTRMAX RTX1868",
                Code = 41169,
                Description = "Батерията и зарядното устройство не са включени към продукта! />\r\n />\r\nТехнически данни: />\r\n />\r\nМощност: 3W />\r\nВградена кука за окачване />\r\nВъзможност за регулиране на посоката: Въртяща се глава на 270°С />\r\nПоложителни ъгли на спиране 0°С-30°С-60°С / 90°С-120°С-150°С-180°С />",
                Price = 37.86M,
                ImageUrl = "https://media.valerii.com/41169o.jpg"
            });

            items.Add(new Item
            {
                Name = "АКУМУЛАТОРЕН ЦИРКУЛЯР 18V 165MM B3 RTRMAX RTX1836A",
                Code = 41166,
                Description = "Циркуляр акумулаторен циркуляр RTRMAX е с модерен компактен дизайн и ергономична дръжка за меко захващане и помощна предна ръкохватка. Алуминиева скоростна кутия с блокировка на шпиндела. Алуминиева отливка с възможност за рязане, алуминиев дисков предпазител. Алуминиев щампован стоманен предпазител на ножа. Многофункционалният превключвател предотвратява включването на машината при авария в захранващата мрежа. Мек старт, защита от автоматично стартиране. Поставя върху материала за обработване, така че да опира само предния край на плота, а трионът да бъде зад материала на разстояние 30-40мм. При работа с ръчен циркуляр е необходимо материалът за обработване да бъде здраво закрепен върху поставки с височина 600 – 700мм от пода и притегнат със стеги. Мястото на прореза трябва да бъде извън поставката. Ръчният циркуляр се придържа с двете ръце, като дясната обхваща ръкохватката му, така че показалецът да бъде върху лоста на електрическия включвател, а лявата ръка обхваща допълнителната ръкохватка към предната част на плота.       />\r\n />\r\nТехнически данни: />\r\n />\r\nМощност: 18V />\r\nБатерия: LI-ION 4 Ah />\r\nОбороти на празен ход: 3650 об./мин  />\r\nДиаметър на диск: 165 мм                            />\r\nДълбочина на рязане: />\r\nпри 90 градуса: 50 mm                        />\r\nОкомплектовка: 2 батерии и зарядно />\r\nКуфар: ДА />",
                Price = 337.22M,
                ImageUrl = "https://media.valerii.com/41166o.jpg"
            });

            items.Add(new Item
            {
                Name = "АКУМУЛАТОРЕН МУЛТИТУЛ 18V RTRMAX RTX1862A",
                Code = 41164,
                Description = "Акумулаторен Мултитул RTRMAX за шлайфане, шлифоване, рязане, полиране, изтъргване на метал и дърво. Мултитула е с компактен дизайн, устойчив държач за аксесоарите. Можете да правите много неща с един инструмент, той е с удобна дръжка против хлъзгане.  />\r\nУредът има регулатор на скоростта, бърз захват на приставките. Мултитула може да се използва за прав разрез на страница на каса врата, за да се осигури място за новата подова настилка, която хубаво да пасне, също така може да се използва за изрязване на отвор в дървена подова настилка, за да се постави отоплителна инсталация, за изрязване на отвор в гипсокартон за поставяне на електрическа изводна кутия, може да се използва и за шлифоване на детайли.  />\r\nЩе намерите всичко, от което се нуждаете в онлайн магазин valerii.com, тук ще откриете огромно разнообразие от градинска техника.  />\r\n />\r\nТехнически данни: />\r\n />\r\nМощност: 18V />\r\nБатерия: LI-ION 3 Ah />\r\nОбороти на празен ход: 5000-15000 об./мин /две скорости/ />\r\nЪгъл на трептене: 3.0°C />\r\nБързозарядно устройство: 80 мин. />\r\nОкомплектовка: батерия и зарядно />\r\nКуфар: ДА />\r\n />\r\n",
                Price = 247.87M,
                ImageUrl = "https://media.valerii.com/41164o.jpg"
            });

            items.Add(new Item
            {
                Name = "АКУМУЛАТОРНА БОРМАШИНА 18V 19200bpm B3 RTRMAX RTX2015A",
                Code = 41142,
                Description = "Бормашина ударна акумулаторна безчетков мотор RTR-MAX е един от най-разпространените и предпочитани помощници в дома, особено когато правим реконструкция или обзавеждаме интериора. Работата с нея понякога може да бъде и по-тежка отколкото е необходимо. А това може да се случи, когато не сте избрали подходящата бормашина. Затова се запознайте със следващите редове по-долу. Бормашината е предназначена за пробиване на отвори в различни материали – дърво, метал, камък, тухла и бетон. За пробиването на твърди материали, бормашината трябва да има още и ударен режим на работа. Ръчната бормашина се захранва от мрежата с напрежение 230 V или от акумулатор с напрежение от 10 до 36 V – безкабелни бормашини. Акумулаторните бормашини се радват на голямо предпочитание поради своите предимства. Не са зависими от електрическото мрежово захранване, не им е необходим кабел, който ограничава радиуса на действие и често пречи и при самата работа. По-тихи са, при тях има възможност да се настрои и затягащия момент, което при повечето конвенционални не се предлага. Ще намерите всичко, от което се нуждаете в онлайн магазин valerii.com, тук ще откриете огромно разнообразие от градинска техника.   />\r\n />\r\nТехнически данни: />\r\n      />\r\nМощност: 18V                                                                              />\r\nБатерия: Samsung LI-ION 4 Ah                           />\r\nМаксимален въртящ момент: 50 Nm />\r\nДве скорости: />\r\nОбороти на празен ход: 0-500 об./мин. / 0-1800 об./мин.                                                                                   />\r\nВреме за зареждане: 3-5ч. />\r\nРазмер на патрона: 13 мм                           />\r\nОкомплектовка: 1 батерии и зарядно                   />\r\nКуфар: ДА />\r\n />\r\n*Снимките може да са примерни />\r\n",
                Price = 406.15M,
                ImageUrl = "https://media.valerii.com/41142o.jpg"
            });

            items.Add(new Item
            {
                Name = "АКУМУЛАТОРНА БОРМАШИНА 18V 28800bpm B3 RTRMAX RTX2016A",
                Code = 41146,
                Description = "Бормашина ударна акумулаторна безчетков мотор RTR-MAX е един от най-разпространените и предпочитани помощници в дома, особено когато правим реконструкция или обзавеждаме интериора. Работата с нея понякога може да бъде и по-тежка отколкото е необходимо. А това може да се случи, когато не сте избрали подходящата бормашина. Затова се запознайте със следващите редове по-долу. Бормашината е предназначена за пробиване на отвори в различни материали – дърво, метал, камък, тухла и бетон. За пробиването на твърди материали, бормашината трябва да има още и ударен режим на работа. Ръчната бормашина се захранва от мрежата с напрежение 230 V или от акумулатор с напрежение от 10 до 36 V – безкабелни бормашини. Акумулаторните бормашини се радват на голямо предпочитание поради своите предимства. Не са зависими от електрическото мрежово захранване, не им е необходим кабел, който ограничава радиуса на действие и често пречи и при самата работа. По-тихи са, при тях има възможност да се настрои и затягащия момент, което при повечето конвенционални не се предлага. Ще намерите всичко, от което се нуждаете в онлайн магазин valerii.com, тук ще откриете огромно разнообразие от градинска техника.   />\r\n />\r\nТехнически данни: />\r\n      />\r\nМощност: 18V                                                                              />\r\nБатерия: Samsung LI-ION 4 Ah                           />\r\nМаксимален въртящ момент: 50 Nm />\r\nДве скорости: />\r\nОбороти на празен ход: 0-500 об./мин. / 0-1800 об./мин.                                                                                   />\r\nВреме за зареждане: 3-5ч. />\r\nРазмер на патрона: 13 мм                           />\r\nОкомплектовка: 1 батерии и зарядно                   />\r\nКуфар: ДА />\r\n />\r\n*Снимките може да са примерни />\r\n",
                Price = 406.15M,
                ImageUrl = "https://media.valerii.com/41146o.jpg"
            });

            items.Add(new Item
            {
                Name = "ЕЛЕКТРИЧЕСКИ ВИНТОВЕРТ 570W RTRMAX RTM313",
                Code = 43325,
                Description = "Електрическа бормашина RTR MAX притежава превключвател за заключване, завъртане наляво/надясно, леко и удобна за работа с 4 метров кабел. Бърза смяна на битовете, бързо пробиване, бутон за фиксиране на спусъка и регулиране на скоростта. />\r\n />\r\nТехнически данни: />\r\n />\r\nМощност: 570W />\r\nНапрежение: 230V/50 Hz />\r\nОбороти на празен ход: 0-6000 об./мин.                    />\r\nВъртящ момент: 9.6 NM                                                    />\r\nРазмер на патрона: 6мм />\r\n",
                Price = 144.00M,
                ImageUrl = "https://media.valerii.com/43325o.jpg"
            });

            items.Add(new Item
            {
                Name = "ЕЛЕКТРИЧЕСКА БОРМАШИНА 710W RTRMAX RTM156",
                Code = 43357,
                Description = "Електрическа бормашина RTR MAX притежава безключов патронник, бърза смяна на битовете, завъртане надясно/ляво, бързо пробиване, бързо пробиване за употреба с една ръка, бутон за фиксиране на спусъка и регулиране на скоростта. />\r\n />\r\nТехнически данни: />\r\n />\r\nМощност: 710W                                                           />\r\nОбороти на празен ход: 0-3000 об./мин.                   />\r\nРазмер на патрона: 10мм />\r\nКапацитет на пробиване:                                                    />\r\nбетон: 10мм />\r\nстомана: 8мм />\r\nдърво: 25мм />\r\n",
                Price = 66.96M,
                ImageUrl = "https://media.valerii.com/43357o.jpg"
            });

            items.Add(new Item
            {
                Name = "УДАРНА БОРМАШИНА 550W RTM1550A RTRMAX",
                Code = 43529,
                Description = "Бормашина ударна RTM1550А с лагери е проектирана за ударно пробиване в бетон, камък и за пробиване на метални, пластични, дървени и стоманени и леки пробивни приложения. Също така може да използва за завинтване и оребрено нарязване и може да се регулира за дясно/ляво въртене и е с електронен контрол. />\r\n />\r\nТехнически данни: />\r\n />\r\nМощност: 550W                                                           />\r\nОбороти на празен ход: 0-2800 об./мин.                  />\r\nРазмер на патрона: 13мм />\r\nКапацитет на пробиване:                                                                          />\r\nбетон: 13мм />\r\nстомана: 8мм />\r\nдърво: 25мм />\r\n",
                Price = 57.98M,
                ImageUrl = "https://media.valerii.com/43529o.jpg"
            });

            items.Add(new Item
            {
                Name = "УДАРНА БОРМАШИНА 710W RTRMAX RTM1570",
                Code = 43530,
                Description = "Бормашина ударна RTM1570 с лагери е проектирана за ударно пробиване в бетон, камък и за пробиване на метални, пластични, дървени и стоманени и леки пробивни приложения. Също така може да използва за завинтване и оребрено нарязване и може да се регулира за дясно/ляво въртене и е с електронен контрол. />\r\n />\r\nТехнически данни: />\r\n />\r\nМощност: 710W                                                           />\r\nОбороти на празен ход: 0-2800 об./мин.                  />\r\nРазмер на патрона: 13мм />\r\nКапацитет на пробиване:                                                                          />\r\nбетон: 13мм />\r\nстомана: 10мм />\r\nдърво: 25мм />\r\n",
                Price = 82.79M,
                ImageUrl = "https://media.valerii.com/43530o.jpg"
            });

            items.Add(new Item
            {
                Name = "ПОМПА СТАЦИОНАРНА 750W 1'x1' 1.0Hp RTRMAX RTM874",
                Code = 45191,
                Description = "Технически данни: />\r\n />\r\nMощност: 750 W />\r\nНапрежение: 230V/50HZ  />\r\nМакс. дълбочина на потапяне: 8м />\r\nМакс. дебит: 3000 л/ч />\r\nМакс. напор: 60 м  />\r\n",
                Price = 184.08M,
                ImageUrl = "https://media.valerii.com/45191o.jpg"
            });

            items.Add(new Item
            {
                Name = "ПОМПА С ПОПЛАВЪК 900W 8.5м 14000 л/мин RTRMAX RTM839",
                Code = 45188,
                Description = "Технически данни: />\r\n />\r\nMощност: 900 W />\r\nНапрежение: 230V/50HZ  />\r\nМакс. дълбочина на потапяне: 10м />\r\nМакс. дебит: 14000 л/м />\r\nМакс. напор: 8.5 м  />\r\n",
                Price = 185.16M,
                ImageUrl = "https://media.valerii.com/45188o.jpg"
            });

            data.Items.AddRange(items);
            data.SaveChanges();
        }
    }
}
